rromenskyi/esp32-speaker/sdkconfig.defaults
# Target board: AliExpress ESP32-S3 smart speaker (ESP32-S3R8, 16MB flash, 8MB PSRAM).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 16MB quad
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 8MB embedded (S3R8 = octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Anti-brick: a freshly OTA'd app that crashes before marking itself valid is
# rolled back by the bootloader on the next boot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Console over the native USB-Serial/JTAG port
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Wi-Fi / network
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
